title: WinSCP Configuration File Creation
id: 95b2683a-89a1-4880-ba42-42da52e77cc7
status: experimental
description: Detects the creation or modification of WinSCP.ini, the configuration file for WinSCP (SFTP/FTP client), which may store session credentials and indicate abuse for data exfiltration in intrusions.
references:
    - https://thedfirreport.com/2025/09/08/blurring-the-lines-intrusion-shows-connection-with-three-major-ransomware-gangs/
author: Mohamed Mostafa
date: 2025/10/06
tags:
    - attack.exfiltration
    - attack.t1048
    - attack.t1560.002
logsource:
    category: file_event
    product: windows
detection:
    selection:
        TargetFilename|endswith: '\WinSCP.ini'
    filter_legit:
        ParentImage|endswith: '\WinSCP.exe'
    condition: selection and not filter_legit  
falsepositives:
    - Legitimate WinSCP installations and usage.
level: medium