title: Veeam Backup Servers Credential Dumping Script Execution
id: 976d6e6f-a04b-4900-9713-0134a353e38b
status: test
description: Detects execution of a PowerShell script that contains calls to the "Veeam.Backup" class, in order to dump stored credentials.
references:
    - https://www.pwndefend.com/2021/02/15/retrieving-passwords-from-veeam-backup-servers/
    - https://labs.withsecure.com/publications/fin7-target-veeam-servers
    - https://thedfirreport.com/2025/09/08/blurring-the-lines-intrusion-shows-connection-with-three-major-ransomware-gangs/
author: Nasreddine Bencherchali (Nextron Systems), Mohamed Mostafa
date: 2023-05-04
modified: 2025-10-08
tags:
    - attack.credential-access
logsource:
    product: windows
    category: ps_script
detection:
    selection:
        ScriptBlockText|contains|all:
            - '[Credentials]'
            - '[user_name]'
            - '[password]'
            - '[VeeamBackup]'
            - 'SELECT '
    condition: selection
falsepositives:
    - Administrators backup scripts (must be investigated)
level: high
