title: PUA - Suspicious ActiveDirectory Enumeration Via AdFind.EXE
id: 455b9d50-15a1-4b99-853f-8d37655a4c1b
status: test
description: Detects active directory enumeration activity using known AdFind CLI flags
references:
    - https://www.joeware.net/freetools/tools/adfind/
    - https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1087.002/T1087.002.md
    - https://thedfirreport.com/2025/09/08/blurring-the-lines-intrusion-shows-connection-with-three-major-ransomware-gangs/
author: frack113, Mohamed Mostafa
date: 2021-12-13
modified: 2024-10-08
tags:
    - attack.discovery
    - attack.t1087.002
    - attack.t1046
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|contains: '\Users\Public\'  
        CommandLine|contains:
            - 'adfind.exe'
            - '-subnets'
            - '-f'
    condition: selection
falsepositives:
    - Authorized administrative activity
level: high
