title: BITS Transfer Job Downloading File Potential Suspicious Extension
id: b85e5894-9b19-4d86-8c87-a2f3b81f0521
status: test
description: Detects new BITS transfer job saving local files with potential suspicious extensions
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
    - https://thedfirreport.com/2025/09/08/blurring-the-lines-intrusion-shows-connection-with-three-major-ransomware-gangs/
author: frack113, Mohamed Mostafa
date: 2022-03-01
modified: 2025-10-08
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
logsource:
    product: windows
    service: bits-client
detection:
    selection:
        EventID: 16403 # BITS Transfer Job Created, Depends on logging configuration. Does the SIEM capture this log channel?
        LocalName|endswith:
            - '.lnk'
        LocalName|contains: '\Start Menu\Programs\Startup\'
    condition: selection
level: medium
